EmcraftSystems/u-boot/board/diolan/lpc4350-db1/board.c
		/*
		 * Copy U-Boot image from NOR flash to internal SRAM
		 *
		 * Originally, it was :
		 * dest = &_mem_nvm_base;
		 * It's ok when there is a header added to the image of U-Boot (see Makefile)
		 * Indeed, the shadow pointer is set to 0x10000000 in this case (see User Manual §5.3.1 Boot process).
		 *
		 * Without header, we have to set manually the local SRAM address (0x10000000).
		 * Instead, we prefer set 0x10000000 which is correct for all cases
		 */
#if !defined( FIXED_SECTIONS_DIOLAN )
		/* FIXED_SECTIONS_DIOLAN ie. no shadowing in 0x00 but boot from flash 0x1C000000 see /cpu/arm_cortexm3/u-boot.lds */

		 dest = CONFIG_LPC43xx_LOCAL_SRAM;
		 src = (void *)(CONFIG_SYS_FLASH_BANK1_BASE +
			CONFIG_LPC18XX_NORFLASH_IMAGE_OFFSET);
		src_end = src + (u32)&_mem_nvm_size;
		for (; src < src_end; src++, dest++)
			*dest = *src;
	 }
#endif

}
#endif /* CONFIG_LPC18XX_NORFLASH_BOOTSTRAP_WORKAROUND */


#define DELAYCYCLES(ns) (ns / ((1.0 / __EMCHZ) * 1E9))
#define DELAYCYCLES_RAM(ns) (ns / ((1.0 / __EMCHZ_RAM) * 1E9))

/*
 * Early hardware init.
 */
int board_init(void)
{
	volatile struct lpc_emc_st_regs *st;


	 /*
	 * Set SDRAM clock output delay to ?? (0x5555), // from LPC4300 demos
	 * the SDRAM chip does not work otherwise. 
	 */
	LPC18XX_SCU->emcdelayclk = ((CLK0_DELAY) |  (CLK0_DELAY << 4) |  (CLK0_DELAY << 8) |  (CLK0_DELAY << 12));

	
	/*
	 * Enable EMC
	 */
	LPC_EMC->emcctrl = 0x00000001;   /* Enable the external memory controller */	
	/*
	 * Little-endian mode
	 */
	LPC_EMC->emccfg = 0x0;
	
	/*
	 * Configure MCU pins
	 */
	iomux_init();



/*
 * Config Flash
*/
#ifdef CONFIG_SYS_FLASH_CS
	/* Set timing for flash */
	st = &LPC_EMC->st[CONFIG_SYS_FLASH_CS];
	st->rd = DELAYCYCLES(70)+1;
	st->page  = DELAYCYCLES(70)+1;
// 	LPC_EMC->emcctrl = 0x00000001;
	st->cfg = CONFIG_SYS_FLASH_CFG;
	st->oe = DELAYCYCLES(35)+1;

	/* not configured in demo, useless? */
	st->we = CONFIG_SYS_FLASH_WE;
	st->wr = CONFIG_SYS_FLASH_WR;
	st->ta = CONFIG_SYS_FLASH_TA;

#endif
	return 0;
}

#define mdelay(n) ({unsigned long msec=(n); while (msec--) udelay(1000);})

/*
 * Dump pertinent info to the console.
 */
int checkboard(void)
{
	printf("Board: Diolan LPC4350-DB1 rev %s\n",
		CONFIG_SYS_BOARD_REV_STR);

	return 0;
}

/*
 * Configure board specific parts.
 */
#ifdef CONFIG_MISC_INIT_R
int misc_init_r(void)
{
	/* TBD */
	return 0;
}
#endif /* CONFIG_MISC_INIT_R */







/*
 * Setup external RAM.
 */
int dram_init(void)
{
	volatile struct lpc_emc_dy_regs *dy0;
	u32 tmp;


#ifdef CONFIG_LPC18XX_EMC_HALFCPU
	/*
	 * EMC_CLK_DIV = M4_CLK / 2
	 */
	LPC18XX_CCU1->clk_m4_emcdiv_cfg |= LPC18XX_CCU1_CLK_RUN_MSK | LPC18XX_CCU1_CLK_EMCDIV_CFG_DIV2;
	LPC18XX_CREG->creg6 |= LPC18XX_CREG_CREG6_EMCCLKSEL_MSK;
	LPC18XX_CCU1->clk_m4_emc_cfg |= LPC18XX_CCU1_CLK_RUN_MSK; 
#else
#error EMC clock set to M4_CLK/2 is not supported
#endif

	dy0 = &LPC_EMC->dy[CONFIG_SYS_RAM_CS];

	   /* Initialize EMC to interface with SDRAM */
	LPC_EMC->emcctrl = 0x00000001;   /* Enable the external memory controller */	
	LPC_EMC->emccfg = 0;

	
	/*
	 * Address mapping
	 */
	dy0->cfg = LPC18XX_EMC_AM; 	


	
	/*
	 * Configure DRAM timing
	 */
	dy0->rascas =
		(SDRAM_RAS << LPC_EMC_DYRASCAS_RAS_BITS) |
		(SDRAM_CAS << LPC_EMC_DYRASCAS_CAS_BITS);



	LPC_EMC->dy_rdcfg =
		(SDRAM_RDCFG_RD << LPC_EMC_DYRDCFG_RD_BITS);

	LPC_EMC->dy_trp  = SDRAM_T_RP;
	LPC_EMC->dy_tras = SDRAM_T_RAS;
	LPC_EMC->dy_srex = SDRAM_T_SREX;
	LPC_EMC->dy_apr  = SDRAM_T_APR;
	LPC_EMC->dy_dal  = SDRAM_T_DAL;
	LPC_EMC->dy_wr   = SDRAM_T_WR;
	LPC_EMC->dy_rc   = SDRAM_T_RC;
	LPC_EMC->dy_rfc  = SDRAM_T_RFC;
	LPC_EMC->dy_xsr  = SDRAM_T_XSR;
	LPC_EMC->dy_rrd  = SDRAM_T_RRD;
	LPC_EMC->dy_mrd  = SDRAM_T_MRD;
	
	mdelay(100);
	/*
	 * Issue SDRAM NOP (no operation) command
	 */
	LPC_EMC->dy_ctrl =
		LPC_EMC_DYCTRL_CE_MSK | LPC_EMC_DYCTRL_CS_MSK |
		(LPC_EMC_DYCTRL_I_NOP << LPC_EMC_DYCTRL_I_BITS);
	mdelay(100);

	/*
	 * Pre-charge all with fast refresh
	 */
	LPC_EMC->dy_ctrl =
		LPC_EMC_DYCTRL_CE_MSK | LPC_EMC_DYCTRL_CS_MSK |
		(LPC_EMC_DYCTRL_I_PALL << LPC_EMC_DYCTRL_I_BITS);

	LPC_EMC->dy_rfsh = SDRAM_REFRESH_FAST;
	
	mdelay(1);
	/*
	 * Set refresh period
	 */
	LPC_EMC->dy_rfsh = SDRAM_REFRESH;

	mdelay(100);

	/*
	 * Load mode register
	 */
	LPC_EMC->dy_ctrl =
		LPC_EMC_DYCTRL_CE_MSK | LPC_EMC_DYCTRL_CS_MSK |
		(LPC_EMC_DYCTRL_I_MODE << LPC_EMC_DYCTRL_I_BITS);
	


	tmp = *((volatile u32 *)(CONFIG_SYS_RAM_BASE |(SDRAM_MODEREG_VALUE << LPC18XX_EMC_MODEREG_ADDR_SHIFT)));

	udelay(100);

	/*
	 * Normal mode
	 */
	LPC_EMC->dy_ctrl = (LPC_EMC_DYCTRL_I_NORMAL << LPC_EMC_DYCTRL_I_BITS);

	/*
	 * Enable DRAM buffer
	 */
	dy0->cfg |= (LPC18XX_EMC_AM << LPC_EMC_DYCFG_AM_BITS) | LPC_EMC_DYCFG_B_MSK;
	

	/*
	 * Fill in global info with description of DRAM configuration
	 */
	gd->bd->bi_dram[0].start = CONFIG_SYS_RAM_BASE;
	gd->bd->bi_dram[0].size  = CONFIG_SYS_RAM_SIZE;

	return 0;
}

#ifdef CONFIG_LPC18XX_ETH
/*
 * Register ethernet driver
 */
int board_eth_init(bd_t *bis)
{
	return lpc18xx_eth_driver_init(bis);
}
#endif

#ifdef CONFIG_FLASH_CFI_LEGACY
ulong board_flash_get_legacy (ulong base, int banknum, flash_info_t *info)
{
	/* non-CFI flash */
/*	if (banknum == 0) {
		info->portwidth = FLASH_CFI_16BIT;
		info->chipwidth = FLASH_CFI_BY16;
		info->interface = FLASH_CFI_X8X16;
		return 1;
	} else */
	/* For Diolan Board, Flash is detected using CFI */

		return 0;
}
#endif


